tests/artillery.yml

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 200
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            name: "eat chicken"
            email: "test@example.com"
            password: "test1234"
            secretWord: "test word"
      - put:
          url: "/users/login"
          json:
            email: "test@example.com"
            password: "{{ $randomString() }}"