tests/artillery.yml

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/todos"
          json:
            name: "eat chicken"
            email: "test@example.com"
            password: "test1234"
            secretWord: "test word"